Autodesk.Revit.DB.FailureDefinitionAccessor.IsResolutionApplicable(Autodesk.Revit.DB.FailureResolutionType)
Checks if the given resolution type is applicable to the failure.
type:
The resolution type to check.
Returns:
True if the given resolution type is applicable to the failure, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.HasResolutions
Checks if the FailureDefinition has at least one resolution.
Returns:
True if at least one resolution is defined in the FailureDefinition.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.GetDefaultResolutionType
Retrieves the default resolution type for the failure.
Returns:
The default resolution type for the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
-or-
FailureDefinition does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.SetDefaultResolutionType(Autodesk.Revit.DB.FailureResolutionType)
Sets the default resolution type for the failure.
Remarks:
If failure has multiple resolutions, one of them is designated as designated as the default resolution. The default resolution
is used by Revit failure processing mechanism to resolve failures automatically when applicable.
type:
The type of resolution to be used as default.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the type is not applicable to the failure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
-or-
FailureDefinition does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.GetResolutionCaption(Autodesk.Revit.DB.FailureResolutionType)
Retrieves the caption for a specific resolution type.
type:
The resolution type.
Returns:
The caption of the resolution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the type is not applicable to the failure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
-or-
FailureDefinition does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.GetDescriptionText
Retrieves the description text of the failure.
Remarks:
Retrieved description text for built-in Revit failures is localized.
The result may vary from the description text retrieved from the corresponding FailureMessage.
A failure definition contains a description string, that may have format specifiers like %s, and "sample" strings,
that will be used to resolve them. A FailureMessage will contain "specific" strings.
So, in the failure definition description "Cannot keep %s joined" will be converted into "Cannot keep Element joined" while
the description in actual FailureMessage will read "Cannot keep Walls joined" or "Cannot keep Beams joined"
Returns:
The description text.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.GetApplicableResolutionTypes
Retrieves a list of resolution types applicable to the failure.
Returns:
The list of resolution types applicable to the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.GetSeverity
Retrieves severity of the failure.
Returns:
The severity of the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.GetId
Retrieves the unique identifier of the FailureDefinition.
Returns:
The unique identifier of the FailureDefinition.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The FailureDefinitionAccessor has not been properly initialized.
Since:
2011

Autodesk.Revit.DB.FailureDefinitionAccessor.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureDefinitionAccessor
A class that provides access to the details of a FailureDefinition after the definition has been defined.
Since:
2011